<!-- php的开始标签和结束标签 -->
<?php

// --注释风格
// php注释风格支持 c c++ shell 
/*
我是c的注释
多行
多行
*/
#我是shell的注释

//基本的表达式(php一行完整的代码) 使用;结束
echo "Hello Word !!";

// php的输出到页面 echo

//PHP中使用变量的形式来承载数据
//php变量的声明-变量名之前加$符号
//变量规则:
//1,可以使用 _ 字母 数字 来命名
//2,不能已数字开头 
//3,必须用$修饰
//4,区分大小写

$name = "php7";


echo "<br>";
echo $name;
var_dump($name); //string(4) "php7" 


echo "<br>";
$age = 10;
var_dump($age);//int(10)

echo "<br>";
$sex = true;
var_dump($sex);//bool(true - false)


echo "<br>";
$weight = 90.11;
var_dump($weight);//float(90.11)


// 数据存储原理
// 计算机的内存大小
//KB :1024 byte (字节)
//MB :1024 kb
//GB :1024 mb
//TB :1024 gb
//PB :1024 tb

//一个字节 byte = 8 位 
//8 bit = 11111111    2^8 = 255
// int 整型 4 个字节 32位2^32 = 21亿(32位系统)
// 64位系统整型最大的9E18 9*10^18
// 9223372036854775807
// 1 = 1*10^0
// 2 = 2*10^0
// 11 = 1*10^0+1*10^1

// 0=00000000 0*2^0
// 1=00000001 1*2^0
// 2=00000010 0*2^0+1*2^1
// 3=00000011 1*2^0+1*2^1
// 4=00000100 0*2^0+0*2^1+1*2^2
// 5=00000101
// 6=00000110
// 7=00000111
// 8=00001000
// 9=00001001
// 10=00001010

echo "<br>";
$int = 2100000000;
var_dump($int);

?>
<!-- 如果不是混合代码(php+html)是纯的PHP 结束标签可以不写 -->