<?php
//if ..else 
//if ..elseif ..else
//全部都可以嵌套使用
//判断逻辑:只要满足给出的条件那么就会执行大括号中的代码
//可以把大括号理解成一个单独写代码的地方

//练习:
//相亲网站注册要求,必须达到适婚年龄才有注册资格
//判断是否达到适婚年龄
//男适婚年龄25
//女适婚年龄23

//用户输入
$people = 'boy'; 
$age = 28;

//写一个逻辑,判断这个用户是否具备注册资格
if ($people == 'boy') {
	if ($age>=25) {
		echo "男具备注册资格";
	}else{
		echo "男资格不达标";
	}
}else{
	if ($age>=23) {
		echo "女具备注册资格";
	}else{
		echo "女资格不达标";
	}
}
//---------------------------------------------
if ($people == 'boy'&&$age>=25) {
	echo "男具备注册资格";
}elseif ($people=='girl'&&$age>=23) {
	echo "女具备注册资格";
}else{
	echo "资格不达标";
}

?>