<?php
//循环结构
//只要while表达式的值为true 会循环执行{}内的语句;
//没有办法结束的循环叫做死循环

$a = 0;
while ($a<=10) {
	echo "<br>$a";
	$a++;
}
// 输出 0-10 偶数 使用while
$a = 0;
$i = 0;
while ($a<= 10) {
	echo "<br>第".$i."次循环";
	$i++;

	echo "<br>---$a";
	$a+=2;	
}

echo "<hr>";
$a = 0;
$i = 0;
while ($a<=10) {
	echo "<br>第".$i."次循环";
	$i++;
	if ($a%2 ==0) {
		echo "<br>====$a";
	}
	$a++;
}

//--
$a = 10;
while ($a>=0) {
	echo "<br>~~~~$a";
	$a-=2;
}

//循环的条件是循环执行的动力,条件只要不满足,循环就停止啦
//以下例子是错误的,谨记不要再犯这种错误
echo "<hr>";
$a = 0;
while ($a<= 10&&$a%2==0) {
	$a++;
	echo "<br>@@@@@@@$a";
}











?>